# How To Condtruct The Pandas DataFrame Objects

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.DataFrame?

In [3]:
states_capitals = {'Karnataka':'Bangalore', 'Andrapradesh':'Hyderabad', 
                   'Tamilnadu':'Chennai', 'Kerala':'Thiruvanathapuram', 'Maharastra':'Mumbai'}

In [4]:
states_lang = {'Karnataka':'Kannada', 'Andrapradesh':'Telugu', 
                 'Tamilnadu':'Tamil', 'Kerala':'Malayalam', 'Maharastra':'Hindi'}

In [5]:
states_CL = pd.DataFrame({'Capitals': states_capitals, 'Language': states_lang})
states_CL

                       Capitals   Language
Karnataka             Bangalore    Kannada
Andrapradesh          Hyderabad     Telugu
Tamilnadu               Chennai      Tamil
Kerala        Thiruvanathapuram  Malayalam
Maharastra               Mumbai      Hindi

In [6]:
print(states_CL)

                       Capitals   Language
Karnataka             Bangalore    Kannada
Andrapradesh          Hyderabad     Telugu
Tamilnadu               Chennai      Tamil
Kerala        Thiruvanathapuram  Malayalam
Maharastra               Mumbai      Hindi

In [7]:
d_list = {'a':[0, 1, 2 ,3, 4], 'b':[0,2,4,6,8], 'c': [0,3,6,9,12]}
d_list

{'a': [0, 1, 2, 3, 4], 'b': [0, 2, 4, 6, 8], 'c': [0, 3, 6, 9, 12]}

In [8]:
df_list = pd.DataFrame(d_list)
df_list

   a  b   c
0  0  0   0
1  1  2   3
2  2  4   6
3  3  6   9
4  4  8  12

In [9]:
data = [{'a': i, 'b': 2 * i, 'c': 3*i} for i in range(5)]
data

[{'a': 0, 'b': 0, 'c': 0},
 {'a': 1, 'b': 2, 'c': 3},
 {'a': 2, 'b': 4, 'c': 6},
 {'a': 3, 'b': 6, 'c': 9},
 {'a': 4, 'b': 8, 'c': 12}]

In [10]:
data_df = pd.DataFrame(data)
data_df

   a  b   c
0  0  0   0
1  1  2   3
2  2  4   6
3  3  6   9
4  4  8  12

In [11]:
states_CL = pd.DataFrame({'Capitals':pd.Series(states_capitals), 'Language': pd.Series(states_lang)})
states_CL

                       Capitals   Language
Karnataka             Bangalore    Kannada
Andrapradesh          Hyderabad     Telugu
Tamilnadu               Chennai      Tamil
Kerala        Thiruvanathapuram  Malayalam
Maharastra               Mumbai      Hindi

In [12]:
df_np = pd.DataFrame(np.random.randn(6, 3), index=['A','B','C','D', 'E','F'], columns=['one', 'two', 'three'])
df_np

        one       two     three
A  1.303715 -0.529320  0.055676
B  0.613585 -1.370934  1.669719
C  0.245173 -1.475937 -0.158097
D -0.763574  0.275970  0.676873
E  1.041551  0.544914 -0.320420
F  0.281443 -0.212118  0.730219

In [13]:
A = np.zeros(5, dtype=[('A', 'i'), ('B', 'f')])
A

array([(0, 0.), (0, 0.), (0, 0.), (0, 0.), (0, 0.)],
      dtype=[('A', '<i4'), ('B', '<f4')])

In [14]:
A_df = pd.DataFrame(A)

In [15]:
A_df

   A    B
0  0  0.0
1  0  0.0
2  0  0.0
3  0  0.0
4  0  0.0

In [17]:
csv_df = pd.read_csv('input/Marks_list.csv')
csv_df

  Student_Name   Sub1   Sub2   Sub3   Sub4   Sub5   Sub6
0     Student1     25     10     10     15     15     16
1     Student2     23     15     15     15     15     17
2     Student3     21     11     12     16     15     19
3     Student4     22     12     15     12     18     15
4     Student5     21     15     16     16     17     18
5     Student6     20     18     17     18     16     17
6     Student7     20     19     18     13     17     19
7     Student8     22     20     15     17     18     20
8     Student9     21     22     14     18     16     23
9    Student10     15     20     15     19     17     25

# Pandas Index Object

## How To Constrct Pandas Index Object?

In [1]:
import pandas as pd

In [2]:
pd.Index?

In [3]:
list = [1, 2, 3, 4, 5, 6, 7, 7]

ind= pd.Index(list)

In [4]:
ind

Int64Index([1, 2, 3, 4, 5, 6, 7, 7], dtype='int64')

In [5]:
ind= pd.Index(list, name='integers')

In [6]:
ind

Int64Index([1, 2, 3, 4, 5, 6, 7, 7], dtype='int64', name='integers')

## How To Access The Index Objects?

In [7]:
print(ind)
ind[2]

Int64Index([1, 2, 3, 4, 5, 6, 7, 7], dtype='int64', name='integers')

3

In [8]:
ind[:3]

Int64Index([1, 2, 3], dtype='int64', name='integers')

In [9]:
ind[::2]

Int64Index([1, 3, 5, 7], dtype='int64', name='integers')

In [10]:
print(ind.dtype, ind.shape, ind.size, ind.ndim)

int64 (8,) 8 1

## Index Methods and Properties

In [11]:
indA = pd.Index([1, 3, 5, 7, 8, 9])
indA

Int64Index([1, 3, 5, 7, 8, 9], dtype='int64')

In [12]:
indB = pd.Index([2, 3, 5, 7, 10, 11])
indB

Int64Index([2, 3, 5, 7, 10, 11], dtype='int64')

In [13]:
indA & indB # intersection

C:\Users\CTI110~1\AppData\Local\Temp/ipykernel_7008/3149530883.py:1: FutureWarning: Index.__and__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__and__.  Use index.intersection(other) instead
  indA & indB # intersection

Int64Index([3, 5, 7], dtype='int64')

In [14]:
indA | indB # union

C:\Users\CTI110~1\AppData\Local\Temp/ipykernel_7008/4042773156.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead
  indA | indB # union

Int64Index([1, 2, 3, 5, 7, 8, 9, 10, 11], dtype='int64')

In [15]:
indA.difference(indB) # differnce

Int64Index([1, 8, 9], dtype='int64')

In [16]:
indA ^ indB # symmtric difference

C:\Users\CTI110~1\AppData\Local\Temp/ipykernel_7008/3820830873.py:1: FutureWarning: Index.__xor__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__xor__.  Use index.symmetric_difference(other) instead
  indA ^ indB # symmtric difference

Int64Index([1, 2, 8, 9, 10, 11], dtype='int64')

In [17]:
indA.intersection(indB)

Int64Index([3, 5, 7], dtype='int64')

In [18]:
indA.union(indB)

Int64Index([1, 2, 3, 5, 7, 8, 9, 10, 11], dtype='int64')

In [19]:
indA.symmetric_difference(indB)

Int64Index([1, 2, 8, 9, 10, 11], dtype='int64')

# How To Construct The Pandas Series

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.Series?

In [3]:
list = [1.0, 2.0, 0.3, 0.4, 0.5, 0.6]

In [4]:
ser_list = pd.Series(list)
ser_list

0    1.0
1    2.0
2    0.3
3    0.4
4    0.5
5    0.6
dtype: float64

In [5]:
pd.Series([1.0, 2.0, 0.3, 0.4, 0.5, 0.6])

0    1.0
1    2.0
2    0.3
3    0.4
4    0.5
5    0.6
dtype: float64

In [6]:
dic = {1:'A', 2:'B', 3:'C', 1:'D', 4:'E', 6:'F'}

In [7]:
ser_dic = pd.Series(dic)
ser_dic

1    D
2    B
3    C
4    E
6    F
dtype: object

In [8]:
ser_scalar = pd.Series(5, index=[1, 2, 3, 4, 5])
ser_scalar

1    5
2    5
3    5
4    5
5    5
dtype: int64

In [9]:
ser_index = pd.Series({1:'A', 2:'B', 3:'C', 1:'D', 4:'E', 6:'F'}, index=[1, 2, 3])
ser_index

1    D
2    B
3    C
dtype: object

In [11]:
ser_csv = pd.read_csv('input/Marks_list.csv')
ser_csv

  Student_Name   Sub1   Sub2   Sub3   Sub4   Sub5   Sub6
0     Student1     25     10     10     15     15     16
1     Student2     23     15     15     15     15     17
2     Student3     21     11     12     16     15     19
3     Student4     22     12     15     12     18     15
4     Student5     21     15     16     16     17     18
5     Student6     20     18     17     18     16     17
6     Student7     20     19     18     13     17     19
7     Student8     22     20     15     17     18     20
8     Student9     21     22     14     18     16     23
9    Student10     15     20     15     19     17     25

In [ ]:
ser_csv['Student_Name']

In [ ]:
print(type(ser_csv))
print(type(ser_csv['Student_Name']))